.. _eu_at_02_userguide:

SEPA Identifier of the Creditor
===============================

Introduction
------------

The function :func:`clean_eu_at_02() <dataprep.clean.clean_eu_at_02.clean_eu_at_02>` cleans a column containing AT-02 (SEPA Creditor identifier) strings, and standardizes them in a given format. The function :func:`validate_eu_at_02() <dataprep.clean.clean_eu_at_02.validate_eu_at_02>` validates either a single AT-02 strings, a column of AT-02 strings or a DataFrame of AT-02 strings, returning `True` if the value is valid, and `False` otherwise.

AT-02 strings can be converted to the following formats via the `output_format` parameter:

* `compact`: only number strings without any seperators or whitespace, like "ES23ZZZ47690558N"
* `standard`: AT-02 strings with proper whitespace in the proper places. Note that in the case of AT-02, the compact format is the same as the standard one.

Invalid parsing is handled with the `errors` parameter:

* `coerce` (default): invalid parsing will be set to NaN
* `ignore`: invalid parsing will return the input
* `raise`: invalid parsing will raise an exception

The following sections demonstrate the functionality of `clean_eu_at_02()` and `validate_eu_at_02()`.

### An example dataset containing AT-02 strings

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
    {
        "eu_at_02": [
            'ES++()+23ZZZ4//7690558N',
            'ES2900047690558N',
            'BE 428759497',
            'BE431150351',
            "002 724 334",
            "hello",
            np.nan,
            "NULL",
        ], 
        "address": [
            "123 Pine Ave.",
            "main st",
            "1234 west main heights 57033",
            "apt 1 789 s maple rd manhattan",
            "robie house, 789 north main street",
            "1111 S Figueroa St, Los Angeles, CA 90015",
            "(staples center) 1111 S Figueroa St, Los Angeles",
            "hello",
        ]
    }
)
df

                  eu_at_02                                           address
0  ES++()+23ZZZ4//7690558N                                     123 Pine Ave.
1         ES2900047690558N                                           main st
2             BE 428759497                      1234 west main heights 57033
3              BE431150351                    apt 1 789 s maple rd manhattan
4              002 724 334                robie house, 789 north main street
5                    hello         1111 S Figueroa St, Los Angeles, CA 90015
6                      NaN  (staples center) 1111 S Figueroa St, Los Angeles
7                     NULL                                             hello

## 1. Default `clean_eu_at_02`

By default, `clean_eu_at_02` will clean eu_at_02 strings and output them in the standard format with proper separators.

In [2]:
from dataprep.clean import clean_eu_at_02
clean_eu_at_02(df, column = "eu_at_02")

,eu_at_02,address,eu_at_02_clean
0,ES++()+23ZZZ4//7690558N,123 Pine Ave.,ES23ZZZ47690558N
1,ES2900047690558N,main st,NaN
2,BE 428759497,1234 west main heights 57033,NaN
3,BE431150351,apt 1 789 s maple rd manhattan,NaN
4,002 724 334,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

## 2. Output formats

This section demonstrates the output parameter.

### `standard` (default)

In [3]:
clean_eu_at_02(df, column = "eu_at_02", output_format="standard")

,eu_at_02,address,eu_at_02_clean
0,ES++()+23ZZZ4//7690558N,123 Pine Ave.,ES23ZZZ47690558N
1,ES2900047690558N,main st,NaN
2,BE 428759497,1234 west main heights 57033,NaN
3,BE431150351,apt 1 789 s maple rd manhattan,NaN
4,002 724 334,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

### `compact`

In [4]:
clean_eu_at_02(df, column = "eu_at_02", output_format="compact")

,eu_at_02,address,eu_at_02_clean
0,ES++()+23ZZZ4//7690558N,123 Pine Ave.,ES23ZZZ47690558N
1,ES2900047690558N,main st,NaN
2,BE 428759497,1234 west main heights 57033,NaN
3,BE431150351,apt 1 789 s maple rd manhattan,NaN
4,002 724 334,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

## 3. `inplace` parameter

This deletes the given column from the returned DataFrame. 
A new column containing cleaned AT-02 strings is added with a title in the format `"{original title}_clean"`.

In [5]:
clean_eu_at_02(df, column="eu_at_02", inplace=True)

     eu_at_02_clean                                           address
0  ES23ZZZ47690558N                                     123 Pine Ave.
1               NaN                                           main st
2               NaN                      1234 west main heights 57033
3               NaN                    apt 1 789 s maple rd manhattan
4               NaN                robie house, 789 north main street
5               NaN         1111 S Figueroa St, Los Angeles, CA 90015
6               NaN  (staples center) 1111 S Figueroa St, Los Angeles
7               NaN                                             hello

## 4. `errors` parameter

### `coerce` (default)

In [6]:
clean_eu_at_02(df, "eu_at_02", errors="coerce")

,eu_at_02,address,eu_at_02_clean
0,ES++()+23ZZZ4//7690558N,123 Pine Ave.,ES23ZZZ47690558N
1,ES2900047690558N,main st,NaN
2,BE 428759497,1234 west main heights 57033,NaN
3,BE431150351,apt 1 789 s maple rd manhattan,NaN
4,002 724 334,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

### `ignore`

In [7]:
clean_eu_at_02(df, "eu_at_02", errors="ignore")

,eu_at_02,address,eu_at_02_clean
0,ES++()+23ZZZ4//7690558N,123 Pine Ave.,ES23ZZZ47690558N
1,ES2900047690558N,main st,ES2900047690558N
2,BE 428759497,1234 west main heights 57033,BE 428759497
3,BE431150351,apt 1 789 s maple rd manhattan,BE431150351
4,002 724 334,"robie house, 789 north main street",002 724 334
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",hello
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

## 4. `validate_eu_at_02()`

`validate_eu_at_02()` returns `True` when the input is a valid AT-02. Otherwise it returns `False`.

The input of `validate_eu_at_02()` can be a string, a Pandas DataSeries, a Dask DataSeries, a Pandas DataFrame and a dask DataFrame.

When the input is a string, a Pandas DataSeries or a Dask DataSeries, user doesn't need to specify a column name to be validated. 

When the input is a Pandas DataFrame or a dask DataFrame, user can both specify or not specify a column name to be validated. If user specify the column name, `validate_eu_at_02()` only returns the validation result for the specified column. If user doesn't specify the column name, `validate_eu_at_02()` returns the validation result for the whole DataFrame.

In [8]:
from dataprep.clean import validate_eu_at_02
print(validate_eu_at_02('ES++()+23ZZZ4//7690558N'))
print(validate_eu_at_02('ES2900047690558N'))
print(validate_eu_at_02('BE 428759497'))
print(validate_eu_at_02('BE431150351'))
print(validate_eu_at_02("004085616"))
print(validate_eu_at_02("hello"))
print(validate_eu_at_02(np.nan))
print(validate_eu_at_02("NULL"))

True
False
False
False
False
False
False
False

### Series

In [9]:
validate_eu_at_02(df["eu_at_02"])

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
Name: eu_at_02, dtype: bool

### DataFrame + Specify Column

In [10]:
validate_eu_at_02(df, column="eu_at_02")

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
Name: eu_at_02, dtype: bool

### Only DataFrame

In [11]:
validate_eu_at_02(df)

   eu_at_02  address
0      True    False
1     False    False
2     False    False
3     False    False
4     False    False
5     False    False
6     False    False
7     False    False